### 탐색적 데이터 분석
> * 데이터 분석이라는 것이 특별히 정해진 규칙은 없음
> * **기본적 작업**
>  * 데이터 출처와 주제에 대한 이해
>  * 데이터 구성요소, 속성 확인
>    * 통계 요약 정보 ( 평균, 중앙값 ... )
>  * 데이터 시각화

In [18]:
import pandas as pd
import numpy as np

In [3]:
import warnings
warnings.simplefilter("ignore")

In [4]:
male_df = pd.read_excel("../../data/dataset/201205_201205_연령별인구현황_월간.xlsx", skiprows=3, usecols="B,E:Y", index_col="행정기관")

In [5]:
male_df.head(3) # Raw-Data 처리 작업 필요

,0~4세,5~9세,10~14세,15~19세,20~24세,25~29세,30~34세,35~39세,40~44세,45~49세,...,55~59세,60~64세,65~69세,70~74세,75~79세,80~84세,85~89세,90~94세,95~99세,100세 이상
행정기관,,,,,,,,,,,,,,,,,,,,,
전국,"1,198,172","1,207,585","1,599,070","1,869,118","1,711,521","1,760,776","2,073,285","2,122,334","2,348,899","2,175,736",...,"1,621,990","1,165,741","891,532","741,383","451,137","200,938","78,881","24,234","4,974","2,777"
서울특별시,"216,517","210,493","276,664","340,569","341,230","413,485","478,161","445,037","464,112","411,676",...,"334,415","244,336","191,755","144,990","76,604","33,283","13,479","4,926","1,231",939
부산광역시,"67,855","68,576","97,550","127,154","124,510","122,771","139,353","132,547","148,018","144,287",...,"137,873","102,391","74,506","56,752","30,848","12,761","4,375","1,232",252,240

In [6]:
female_df = pd.read_excel("../../data/dataset/201205_201205_연령별인구현황_월간.xlsx", skiprows=3, usecols="B,AB:AV", index_col="행정기관")

In [7]:
female_df.head(3)

,0~4세.1,5~9세.1,10~14세.1,15~19세.1,20~24세.1,25~29세.1,30~34세.1,35~39세.1,40~44세.1,45~49세.1,...,55~59세.1,60~64세.1,65~69세.1,70~74세.1,75~79세.1,80~84세.1,85~89세.1,90~94세.1,95~99세.1,100세 이상.1
행정기관,,,,,,,,,,,,,,,,,,,,,
전국,"1,129,060","1,121,396","1,465,153","1,656,457","1,537,488","1,653,792","1,989,544","2,042,452","2,264,185","2,069,661",...,"1,636,447","1,215,014","1,010,384","953,529","715,809","439,376","213,337","76,800","19,704","9,247"
서울특별시,"204,668","197,929","255,648","307,415","336,299","421,862","470,272","431,062","458,791","410,729",...,"361,440","263,508","207,922","164,435","110,761","68,312","35,495","13,473","4,029","2,763"
부산광역시,"64,380","63,569","87,600","108,202","110,117","115,800","133,307","128,579","149,794","148,779",...,"144,382","107,907","80,560","70,080","48,033","29,499","13,629","4,336","1,182",876

---

## 데이터 전처리
> * 데이터를 분석하기 위해 가공

In [8]:
male_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 전국   to 제주특별자치도
Data columns (total 21 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   0~4세     17 non-null     object
 1   5~9세     17 non-null     object
 2   10~14세   17 non-null     object
 3   15~19세   17 non-null     object
 4   20~24세   17 non-null     object
 5   25~29세   17 non-null     object
 6   30~34세   17 non-null     object
 7   35~39세   17 non-null     object
 8   40~44세   17 non-null     object
 9   45~49세   17 non-null     object
 10  50~54세   17 non-null     object
 11  55~59세   17 non-null     object
 12  60~64세   17 non-null     object
 13  65~69세   17 non-null     object
 14  70~74세   17 non-null     object
 15  75~79세   17 non-null     object
 16  80~84세   17 non-null     object
 17  85~89세   17 non-null     object
 18  90~94세   17 non-null     object
 19  95~99세   17 non-null     object
 20  100세 이상  17 non-null     object
dtypes: object(21)
memory usage: 2.9+ KB

In [9]:
female_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 전국   to 제주특별자치도
Data columns (total 21 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   0~4세.1     17 non-null     object
 1   5~9세.1     17 non-null     object
 2   10~14세.1   17 non-null     object
 3   15~19세.1   17 non-null     object
 4   20~24세.1   17 non-null     object
 5   25~29세.1   17 non-null     object
 6   30~34세.1   17 non-null     object
 7   35~39세.1   17 non-null     object
 8   40~44세.1   17 non-null     object
 9   45~49세.1   17 non-null     object
 10  50~54세.1   17 non-null     object
 11  55~59세.1   17 non-null     object
 12  60~64세.1   17 non-null     object
 13  65~69세.1   17 non-null     object
 14  70~74세.1   17 non-null     object
 15  75~79세.1   17 non-null     object
 16  80~84세.1   17 non-null     object
 17  85~89세.1   17 non-null     object
 18  90~94세.1   17 non-null     object
 19  95~99세.1   17 non-null     object
 20  100세 이상.1  17 non-null     object
dtypes: object(21)
memory usage: 2.9+ KB

In [10]:
male_df.columns

Index(['0~4세', '5~9세', '10~14세', '15~19세', '20~24세', '25~29세', '30~34세',
       '35~39세', '40~44세', '45~49세', '50~54세', '55~59세', '60~64세', '65~69세',
       '70~74세', '75~79세', '80~84세', '85~89세', '90~94세', '95~99세', '100세 이상'],
      dtype='object')

In [11]:
female_df.columns # col.1 ColumnName 변경 필요

Index(['0~4세.1', '5~9세.1', '10~14세.1', '15~19세.1', '20~24세.1', '25~29세.1',
       '30~34세.1', '35~39세.1', '40~44세.1', '45~49세.1', '50~54세.1', '55~59세.1',
       '60~64세.1', '65~69세.1', '70~74세.1', '75~79세.1', '80~84세.1', '85~89세.1',
       '90~94세.1', '95~99세.1', '100세 이상.1'],
      dtype='object')

In [12]:
female_df.columns = male_df.columns

---

#### " , " 가 붙은 데이터의 타입을 숫자형태로 변경 ( , 제거 후 타입변환 )

In [29]:
data = {
    "name" : ['홍길동', '김수정', '이민정'],
    "age" : ["25", np.nan, "45"],
}

df = pd.DataFrame(data)
df

  name  age
0  홍길동   25
1  김수정  NaN
2  이민정   45

In [30]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   age     2 non-null      object
dtypes: object(2)
memory usage: 176.0+ bytes

In [31]:
df['age_1'] = df['age'].astype("int64")
df.info()

ValueError: cannot convert float NaN to integer

* astype() >> values 가 NaN 을 포함하고 있으면 에러 발생
* pd.to_numeric() >> NaN 을 무시하고 가능한 것만 타입 변경 ( float64 형태 :: NaN 이 포함된 경우는 float64 형태로 고정 )

In [52]:
df['age_1'] = pd.to_numeric(df['age'])
df

  name  age  age_1
0  홍길동   25   25.0
1  김수정  NaN    NaN
2  이민정   45   45.0

In [50]:
pd.to_numeric?

In [36]:
male_df['0~4세'].str.replace(",", "").astype("int64")

행정기관
전국           1198172
서울특별시         216517
부산광역시          67855
대구광역시          53733
인천광역시          69046
광주광역시          37318
대전광역시          38655
울산광역시          29791
경기도           320571
강원도            32255
충청북도           37743
충청남도           53677
전라북도           41828
전라남도           41332
경상북도           59329
경상남도           83563
제주특별자치도        14959
Name: 0~4세, dtype: int64

In [37]:
male_df['90~94세'].str.replace(",", "").astype("int64")

행정기관
전국           24234
서울특별시         4926
부산광역시         1232
대구광역시          778
인천광역시         1253
광주광역시          427
대전광역시          609
울산광역시          238
경기도           5135
강원도           1228
충청북도           939
충청남도          1454
전라북도          1192
전라남도          1342
경상북도          1856
경상남도          1359
제주특별자치도        266
Name: 90~94세, dtype: int64

In [46]:
ap_male = male_df.apply(lambda x : x.str.replace(",", "").astype("int64"))

In [47]:
ap_male.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 전국   to 제주특별자치도
Data columns (total 21 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   0~4세     17 non-null     int64
 1   5~9세     17 non-null     int64
 2   10~14세   17 non-null     int64
 3   15~19세   17 non-null     int64
 4   20~24세   17 non-null     int64
 5   25~29세   17 non-null     int64
 6   30~34세   17 non-null     int64
 7   35~39세   17 non-null     int64
 8   40~44세   17 non-null     int64
 9   45~49세   17 non-null     int64
 10  50~54세   17 non-null     int64
 11  55~59세   17 non-null     int64
 12  60~64세   17 non-null     int64
 13  65~69세   17 non-null     int64
 14  70~74세   17 non-null     int64
 15  75~79세   17 non-null     int64
 16  80~84세   17 non-null     int64
 17  85~89세   17 non-null     int64
 18  90~94세   17 non-null     int64
 19  95~99세   17 non-null     int64
 20  100세 이상  17 non-null     int64
dtypes: int64(21)
memory usage: 3.5+ KB

In [48]:
ap_female = female_df.apply(lambda x : x.str.replace(",", "").astype("int64"))

In [49]:
ap_female.info()

<class 'pandas.core.frame.DataFrame'>
Index: 17 entries, 전국   to 제주특별자치도
Data columns (total 21 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   0~4세     17 non-null     int64
 1   5~9세     17 non-null     int64
 2   10~14세   17 non-null     int64
 3   15~19세   17 non-null     int64
 4   20~24세   17 non-null     int64
 5   25~29세   17 non-null     int64
 6   30~34세   17 non-null     int64
 7   35~39세   17 non-null     int64
 8   40~44세   17 non-null     int64
 9   45~49세   17 non-null     int64
 10  50~54세   17 non-null     int64
 11  55~59세   17 non-null     int64
 12  60~64세   17 non-null     int64
 13  65~69세   17 non-null     int64
 14  70~74세   17 non-null     int64
 15  75~79세   17 non-null     int64
 16  80~84세   17 non-null     int64
 17  85~89세   17 non-null     int64
 18  90~94세   17 non-null     int64
 19  95~99세   17 non-null     int64
 20  100세 이상  17 non-null     int64
dtypes: int64(21)
memory usage: 2.9+ KB